{
    "posts": [
        {
            "id": 1,
            "name": "DM",
            "timestamp": "Jan 14, 2018 @ 1:30pm",
            "content": "<p><strong>Kickoff Post</strong></p><p><br></p><p>Your ship, the Riptide, pulls into the bay just as the sun rises on the horizon behind you. After a voyage of over a month, Shorehaven’s docks are now only a few minutes away. Since the rediscovery of Oshenshale, Shorehaven is just one of a half-dozen frontier towns to spring up in the mad scramble to explore the lost island.</p><p><br></p><p>The first thing you notice about Shorehaven is that it’s an utter eyesore. If you’re being generous, most of the buildings in the town can only be described as shantys. It appears that the initial settlers were content to build their homes and businesses in the first available spot they found, and newcomers after them happily followed that practice. The muddy streets curve and wind their way through the settlement in a hopelessly haphazard manner.</p><p><br></p><p>The second thing you notice, as your boat pulls up to the docks, is the smell. Rotten fish, rubbish piles, and human waste take turns attempting to assault your nose with every change of the wind’s direction.</p><p>The third thing you notice is the buzz of activity. A few happenings catch your eye:</p><p><br></p><ul><li>An inn,&nbsp;<em>Selena’s Hearth</em>, is crowded with an assortment of different types. Other than the temple, it looks to be the only multistoried building in town. The first floor houses a common area that serves drinks and food. The place is bustling; Halfing Fisherman, Half-Orc mercenaries, Dwarven craftsmen, Human traders, and Elven clergymen are all vying for the serving staff’s attention.&nbsp;</li><li>Near the center of town there is a crowded bazaar. Even at a distance, you can tell that there is a wide variety of goods for sale: Apples, Arms, Armor, Alpacas, and whatever else you can imagine. The street seems close to bursting with all the bodies, stalls, goods and livestock.&nbsp;</li><li>A notably unsavory tavern,&nbsp;<em>The Butchered Blacksmith</em>, has a few shady looking individuals hanging around the entryway and harassing pedestrians passing by. The door swings open as a dwarven woman, near the size of a male human, throws out a cursing halfing. He lands in the mud directly outside. As she stops to spit on him from the doorway, you see a dimly lit interior that houses card tables and a fighting circle.&nbsp;</li><li>On the next dock over a few of the town guard are arguing with some sailors, with tensions rising quickly. You catch some words spoken about stolen goods.&nbsp;</li><li>A large temple, dedicated to Ryoth, is acting as a makeshift hospital. The patients are covered with purple scars that run down their body in a lightning pattern. Overworked clerics and nurses scramble around tending to their patients.&nbsp;</li><li>A town crier is making an announcement about the town guard and Shorehaven’s mayor. Words like corruption and treason are thrown out, but little can be heard over all the other noise.&nbsp;</li></ul><p><br></p><p>After your ship is finally anchored and the gangway is put in place. Ezra Ohtli, guild leader of&nbsp;The Good Children, turns to you and says&nbsp;<strong>\"I'll procure us a stay at the inn before nightfall. Until then, all hands dismissed.\"</strong>. His second in command, Jiù Jiāng, hands you 10 gold pieces as you pass, a signing bonus for joining the guild.&nbsp;<span style=\"color: blue;\">Don’t forget to add 10 gold pieces (GP) to your inventory&nbsp;.</span> Slightly richer, you set off to spend the day before rejoining your guild in the evening.</p><p><br></p><p><span style=\"color: blue;\">Ezra Ohtli and Jiù Jiāng, your guild leader and his second in command respectively, are other players. They’re both experienced in D&amp;D and will be able to give you&nbsp;in character&nbsp;advice.</span></p><p><br></p><p><span style=\"color: blue;\">I’ve listed a few things you spotted in town that might sound interesting to you, but then again maybe you have a different idea on how to spend your first day. Where does your character go and what do they do?</span></p>"
        }
    ]
}